import "./agreements.sass";

const Agreements: React.FC = () => {
  return (
    <div className="agreements">
      <div className="agreements__wrapper">
        <p className="agreements__title">Пользовательское соглашение</p>
        1. Общие положения
        <br />
        <br />
        1.1. Настоящее Соглашение регулирует отношения между Администрацией
        сайта Real estate, именуемой в дальнейшем «Администрация», и любым
        лицом, получившим доступ к материалам и сервисам сайта Real estate,
        именуемым в дальнейшем «Пользователь».
        <br />
        <br />
        1.2. Использование Сайта означает безоговорочное согласие Пользователя
        со всеми пунктами настоящего Соглашения. В случае несогласия с
        каким-либо пунктом Соглашения Пользователь обязан отказаться от
        использования Сайта.
        <br />
        <br />
        2. Определение терминов
        <br />
        <br />
        2.1. Сайт – совокупность информации и сервисов, доступных пользователю
        через сеть Интернет по адресу Real-estate.
        <br />
        2.2. Администрация сайта – лицо, ответственное за управление Сайтом и
        его содержимым.
        <br />
        2.3. Пользователь – любое лицо, имеющее доступ к Сайту через сеть
        Интернет и использующее его сервисы.
        <br />
        2.4. Контент – любая информация, в том числе текстовая, графическая,
        аудио- и видеоматериалы, размещенная на Сайте.
        <br />
        <br />
        3. Права и обязанности Пользователя
        <br />
        <br />
        3.1. Пользователь имеет право:
        <br />
        * Получать доступ к информации, размещенной на Сайте.
        <br />
        * Использовать Сайт в личных некоммерческих целях.
        <br />
        <br />
        3.2. Пользователь обязан:
        <br />
        * Соблюдать действующее законодательство РБ.
        <br />
        * Не предпринимать действий, направленных на нарушение работы Сайта.
        <br />
        * Не распространять на Сайте информацию, нарушающую права и законные
        интересы третьих лиц.
        <br />
        * Не использовать Сайт для распространения спама, вирусов и других
        вредоносных программ.
        <br />
        <br />
        4. Права и обязанности Администрации
        <br />
        <br />
        4.1. Администрация имеет право:
        <br />
        * Изменять структуру Сайта.
        <br />
        * Изменять или удалять любой Контент без предварительного уведомления
        Пользователя.
        <br />
        * Ограничивать доступ к определенным разделам Сайта или всему Сайту в
        целом.
        <br />
        * Блокировать доступ Пользователя к Сайту в случае нарушения им условий
        настоящего Соглашения.
        <br />
        <br />
        4.2. Администрация обязуется:
        <br />
        * Поддерживать работоспособность Сайта.
        <br />
        * Уважать авторские права третьих лиц.
        <br />
        <br />
        5. Ответственность
        <br />
        <br />
        5.1. Администрация не несет ответственности за:
        <br />
        * Точность и полноту информации, размещенной на Сайте.
        <br />
        * Убытки, причиненные Пользователю в результате использования Сайта.
        <br />
        * Действия других Пользователей.
        <br />
        <br />
        5.2. Пользователь несет полную ответственность за содержание размещаемой
        им информации.
        <br />
        <br />
        6. Прочие условия
        <br />
        <br />
        6.1. Настоящее Соглашение может быть изменено Администрацией без
        какого-либо специального уведомления. Новая редакция Соглашения вступает
        в силу с момента ее размещения на Сайте. <br />
        <br />
        6.2. Все споры, возникающие из настоящего Соглашения, разрешаются в
        соответствии с законодательством Республики Беларусь.
      </div>
    </div>
  );
};

export default Agreements;
